# 1. создать пустой массив
# 2. заполнить массив числами от 1 до N
# 3. заполнить массив случайными числами от -N до N (включительно)
# 4. вывести элементы массива
# 4.1. вывести элементы массива и их индекс
# 5. вывести элементы массива в строку
# 6. вывести элементы массива на четных индексах
# 7. вывести элементы массива на НЕчетных индексах
# 8. вывести только четные элементы массива
# 9. вывести только четные элементы массива, которые больше M
# 10. заполнить массив с клавиатуры
# 11. удалить из массива отрицательные числа
# 12. заменить все отрицательные числа их модулем
# 13. собрать в новый массив индексы отрицательных элементов
# 14. вывести индексы максимального и минимального элемента массива
# 15. поменять местами максимальный и минимальный элемент

a = []
for i in range(10):
    a.append(i)

for i in a:
    i = 3

print(print(a))